In [1]:
import numpy as np
import pandas as pd

In [2]:
X = pd.read_csv(r"C:\Users\avsmu\Downloads\Data Science Project\Credit_card.csv")
y = pd.read_csv(r"C:\Users\avsmu\Downloads\Data Science Project\Credit_card_label.csv")

In [3]:
dataset = pd.concat([X, y], axis=1)

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1548 entries, 0 to 1547
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ind_ID           1548 non-null   int64
 1   GENDER           1541 non-null   object
 2   Car_Owner        1548 non-null   object
 3   Propert_Owner    1548 non-null   object
 4   CHILDREN         1548 non-null   int64
 5   Annual_income    1525 non-null   float64
 6   Type_Income      1548 non-null   object
 7   EDUCATION        1548 non-null   object
 8   Marital_status   1548 non-null   object
 9   Housing_type     1548 non-null   object
 10  Birthday_count   1526 non-null   float64
 11  Employed_days    1548 non-null   int64
 12  Mobile_phone     1548 non-null   int64
 13  Work_Phone       1548 non-null   int64
 14  Phone            1548 non-null   int64
 15  EMAIL_ID         1548 non-null   int64
 16  Type_Occupation  1060 non-null   object
 17  Family_Members   1548 non-null   int64
 18  Ind_ID           1548 non-null   int64
 19  label            1548 non-null   int64
dtypes: float64(2), int64(10), object(8)
memory usage: 242.0+ KB

In [5]:
dataset.isnull().sum()

Ind_ID               0
GENDER               7
Car_Owner            0
Propert_Owner        0
CHILDREN             0
Annual_income       23
Type_Income          0
EDUCATION            0
Marital_status       0
Housing_type         0
Birthday_count      22
Employed_days        0
Mobile_phone         0
Work_Phone           0
Phone                0
EMAIL_ID             0
Type_Occupation    488
Family_Members       0
Ind_ID               0
label                0
dtype: int64

In [6]:
dataset.head()

,Ind_ID,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Type_Occupation,Family_Members,Ind_ID,label
0,5008827,M,Y,Y,0,180000.0,Pensioner,Higher education,Married,House / apartment,-18772.0,365243,1,0,0,0,NaN,2,5008827,1
1,5009744,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2,5009744,1
2,5009746,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,NaN,-586,1,1,1,0,NaN,2,5009746,1
3,5009749,F,Y,N,0,NaN,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2,5009749,1
4,5009752,F,Y,N,0,315000.0,Commercial associate,Higher education,Married,House / apartment,-13557.0,-586,1,1,1,0,NaN,2,5009752,1

In [7]:
dataset.drop(["Ind_ID"], axis=1, inplace=True)

In [8]:
dataset["GENDER"].unique()

array(['M', 'F', nan], dtype=object)

In [9]:
dataset["CHILDREN"].value_counts()

0     1091
1      305
2      134
3       16
4        1
14       1
Name: CHILDREN, dtype: int64

In [10]:
dataset.drop(dataset[dataset["CHILDREN"] == 14].index, axis=0, inplace=True)

In [11]:
dataset["EDUCATION"].unique()

array(['Higher education', 'Secondary / secondary special',
       'Lower secondary', 'Incomplete higher', 'Academic degree'],
      dtype=object)

In [12]:
dataset["EDUCATION"].replace("Secondary / secondary special", "Secondary", inplace=True)

In [13]:
dataset["Marital_status"].unique()

array(['Married', 'Single / not married', 'Civil marriage', 'Separated',
       'Widow'], dtype=object)

In [14]:
dataset["Marital_status"].replace("Single / not married", "Single", inplace=True)

In [15]:
dataset["Housing_type"].unique()

array(['House / apartment', 'With parents', 'Rented apartment',
       'Municipal apartment', 'Co-op apartment', 'Office apartment'],
      dtype=object)

In [16]:
dataset["Housing_type"].replace("House / apartment", "House", inplace=True)

In [17]:
dataset["Family_Members"].unique()

array([2, 3, 1, 4, 6, 5], dtype=int64)

In [18]:
dataset.isnull().sum()

GENDER               7
Car_Owner            0
Propert_Owner        0
CHILDREN             0
Annual_income       23
Type_Income          0
EDUCATION            0
Marital_status       0
Housing_type         0
Birthday_count      22
Employed_days        0
Mobile_phone         0
Work_Phone           0
Phone                0
EMAIL_ID             0
Type_Occupation    488
Family_Members       0
label                0
dtype: int64

In [19]:
dataset["GENDER"].value_counts()

F    973
M    567
Name: GENDER, dtype: int64

In [20]:
dataset["GENDER"].fillna("F", inplace=True)

In [21]:
meansval = dataset["Annual_income"].mean()
dataset["Annual_income"].fillna(meansval, inplace = True)

In [22]:
meansval = dataset["Birthday_count"].mean()
dataset["Birthday_count"].fillna(meansval, inplace = True)

In [23]:
dataset.drop(["Type_Occupation"], axis=1, inplace=True)

In [24]:
dataset.head()

,GENDER,Car_Owner,Propert_Owner,CHILDREN,Annual_income,Type_Income,EDUCATION,Marital_status,Housing_type,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Family_Members,label
0,M,Y,Y,0,180000.000000,Pensioner,Higher education,Married,House,-18772.000000,365243,1,0,0,0,2,1
1,F,Y,N,0,315000.000000,Commercial associate,Higher education,Married,House,-13557.000000,-586,1,1,1,0,2,1
2,F,Y,N,0,315000.000000,Commercial associate,Higher education,Married,House,-16039.218361,-586,1,1,1,0,2,1
3,F,Y,N,0,191377.278543,Commercial associate,Higher education,Married,House,-13557.000000,-586,1,1,1,0,2,1
4,F,Y,N,0,315000.000000,Commercial associate,Higher education,Married,House,-13557.000000,-586,1,1,1,0,2,1

In [25]:
dataset.isnull().sum()

GENDER            0
Car_Owner         0
Propert_Owner     0
CHILDREN          0
Annual_income     0
Type_Income       0
EDUCATION         0
Marital_status    0
Housing_type      0
Birthday_count    0
Employed_days     0
Mobile_phone      0
Work_Phone        0
Phone             0
EMAIL_ID          0
Family_Members    0
label             0
dtype: int64

In [26]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1547 entries, 0 to 1547
Data columns (total 17 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   GENDER          1547 non-null   object
 1   Car_Owner       1547 non-null   object
 2   Propert_Owner   1547 non-null   object
 3   CHILDREN        1547 non-null   int64
 4   Annual_income   1547 non-null   float64
 5   Type_Income     1547 non-null   object
 6   EDUCATION       1547 non-null   object
 7   Marital_status  1547 non-null   object
 8   Housing_type    1547 non-null   object
 9   Birthday_count  1547 non-null   float64
 10  Employed_days   1547 non-null   int64
 11  Mobile_phone    1547 non-null   int64
 12  Work_Phone      1547 non-null   int64
 13  Phone           1547 non-null   int64
 14  EMAIL_ID        1547 non-null   int64
 15  Family_Members  1547 non-null   int64
 16  label           1547 non-null   int64
dtypes: float64(2), int64(8), object(7)
memory usage: 217.5+ KB

In [27]:
dataset = pd.get_dummies(data = dataset, drop_first = True)

In [28]:
dataset.head()

,CHILDREN,Annual_income,Birthday_count,Employed_days,Mobile_phone,Work_Phone,Phone,EMAIL_ID,Family_Members,label,...,EDUCATION_Secondary,Marital_status_Married,Marital_status_Separated,Marital_status_Single,Marital_status_Widow,Housing_type_House,Housing_type_Municipal apartment,Housing_type_Office apartment,Housing_type_Rented apartment,Housing_type_With parents
0,0,180000.000000,-18772.000000,365243,1,0,0,0,2,1,...,0,1,0,0,0,1,0,0,0,0
1,0,315000.000000,-13557.000000,-586,1,1,1,0,2,1,...,0,1,0,0,0,1,0,0,0,0
2,0,315000.000000,-16039.218361,-586,1,1,1,0,2,1,...,0,1,0,0,0,1,0,0,0,0
3,0,191377.278543,-13557.000000,-586,1,1,1,0,2,1,...,0,1,0,0,0,1,0,0,0,0
4,0,315000.000000,-13557.000000,-586,1,1,1,0,2,1,...,0,1,0,0,0,1,0,0,0,0

In [29]:
X = dataset.iloc[:, :-1]
y = dataset.iloc[:, -1]

In [30]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3)

In [31]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [32]:
from sklearn.neighbors import KNeighborsClassifier 
classifier = KNeighborsClassifier(n_neighbors = 5, metric='minkowski', p=2)
classifier.fit(X_train, y_train)

KNeighborsClassifier()

In [33]:
y_pred = classifier.predict(X_test)

In [34]:
from sklearn.metrics import confusion_matrix, classification_report, accuracy_score
acs = accuracy_score(y_test, y_pred)
cm = confusion_matrix(y_test, y_pred)
cr = classification_report(y_test, y_pred)

In [35]:
print(acs)
print(cm)
print(cr)

0.989247311827957
[[443   0]
 [  5  17]]
              precision    recall  f1-score   support

           0       0.99      1.00      0.99       443
           1       1.00      0.77      0.87        22

    accuracy                           0.99       465
   macro avg       0.99      0.89      0.93       465
weighted avg       0.99      0.99      0.99       465